### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudflare_record.mp-a-192-168-64-10 will be created
+   resource "cloudflare_record" "mp-a-192-168-64-10" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "mp-ds-03"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = 1
+       type            = "A"
+       value           = "192.168.64.10"
+       zone_id         = (sensitive value)
    }

  # cloudflare_record.mp-a-192-168-64-8 will be created
+   resource "cloudflare_record" "mp-a-192-168-64-8" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "mp-ds-01"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = 1
+       type            = "A"
+       value           = "192.168.64.8"
+       zone_id         = (sensitive value)
    }

  # cloudflare_record.mp-a-192-168-64-9 will be created
+   resource "cloudflare_record" "mp-a-192-168-64-9" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "mp-ds-02"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = 1
+       type            = "A"
+       value           = "192.168.64.9"
+       zone_id         = (sensitive value)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>